Tekla.Structures.Dialog.ErrorDialog.Severity
The severity of the message to be displayed.

Tekla.Structures.Dialog.ErrorDialog.Severity.INFO
The message is for informing.

Tekla.Structures.Dialog.ErrorDialog.Severity.WARNING
The message is for warning.

Tekla.Structures.Dialog.ErrorDialog.Severity.ERROR
The message is for notifying that an error has occurred.